const debug = (...msg) => {
  if (process.env.NODE_ENV === 'development') {
    console.debug(...msg)
  }
}

const page = {
  page: 1,
  pages: 2,
  pageSize: 10,
  sort: [],
  order: [],
  filed: [],
  keyWord: [],
  keyParam: {},
  start: null,
  end: null,
  series: false,
  total: 0,
  hasNextPage: true
}

const molds = ['国有企业', '集体企业', '事业单位', '机关单位', '非公有制内资企业', '外资企业']
const industrys = ['农、林、牧、渔业', '采矿业', '制造业', '电力、燃气及水的生产和供应业', '建筑业', '交通运输、仓储及邮政业',
  '信息传输、计算机服务和软件业', '批发和零售业', '住宿和餐饮业', '金融业', '房地产业', '租赁和商业服务业',
  '科学研究、技术服务和地址勘查业', '水利、环境和公共设施管理业', '居民服务和其他服务业', '教育', '卫生、社会保障和社会福利业',
  '文化、体育和娱乐业', '公共管理和社会组织', '国际组织'
]
const leve = ['区模范职工之家', '区先进职工之家', '市模范职工之家', '市先进职工之家', '省模范职工之家', '省先进职工之家',
  '全国模范职工之家', '全国先进职工之家']
const politicals = ['中共党员', '共青团员', '无党派人士', '群众', '民革', '民盟', '民建', '民进', '农工党', '致公党', '台盟', '九三学社']
const cultures = ['小学及以下', '初中', '高中、技校', '中专', '大专', '大学本科', '硕士研究生', '博士研究生']
const skills = ['初级工', '中级工', '高级工', '技师', '高级技师', '初级职称', '中级职称', '高级职称', '无']
const levels = ['全国', '省部级', '市级']
const employments = ['在岗', '待岗', '失业', '病休', '退休', '退职', '退养（即内退）']
const nations = ['汉族', '蒙古族', '回族', '藏族', '维吾尔族', '苗族', '彝族', '壮族', '布依族', '朝鲜族', '满族', '侗族', '瑶族', '白族', '土家族', '哈尼族', '哈萨克族', '傣族', '黎族', '傈僳族', '佤族', '畲族', '高山族', '拉祜族', '水族', '东乡族', '纳西族', '景颇族', '柯尔克孜族', '土族', '达斡尔族', '仫佬族', '羌族', '布朗族', '撒拉族', '毛南族', '仡佬族', '锡伯族', '阿昌族', '普米族', '塔吉克族', '怒族', '乌孜别克族', '俄罗斯族', '鄂温克族', '德昂族', '保安族', '裕固族', '京族', '塔塔尔族', '独龙族', '鄂伦春族', '赫哲族', '门巴族', '珞巴族', '基诺族']
export {
  debug,
  page,
  molds,
  industrys,
  politicals,
  cultures,
  skills,
  levels,
  employments,
  nations,
  leve
}
